KansOptTorg Configuration/src/Documents/ГрафикРаботы/ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикРаботы</name>
  <registerRecords>InformationRegister.ГрафикРаботы</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

KansOptTorg Configuration/src/InformationRegisters/ГрафикРаботы/ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикРаботы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

KansOptTorg Configuration/src/Documents/ГрафикРаботы/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	ТекущаяДатаДня = ДатаНачала;
	
	Движения.ГрафикРаботы.Записывать = Истина;
	Пока ТекущаяДатаДня<=ДатаКонца цикл
		
		Движение = Движения.ГрафикРаботы.Добавить();
		Движение.Дата = ТекущаяДатаДня;
	
	//Увы и ах, мой грандиозный план с записью булева, вместо 0 и 1 провалился, карету мне, карету
		Если ДеньНедели(ТекущаяДатаДня)<6 тогда
			Движение.РабочийДень = 1;
		Иначе
			Движение.РабочийДень = 0;
		КонецЕсли;
		
		ТекущаяДатаДня= ТекущаяДатаДня + 86399+1;
	
	КонецЦикла;

КонецПроцедуры
